{
   "catalog":{
      "uuid":"e95fb23c-57d2-495f-8ab5-2c6b3152bcee",
      "metadata":{
         "title":"CIS Controls",
         "last-modified":"2022-01-19T16:00:34.033789-05:00",
         "version":"8.0",
         "oscal-version":"1.0.0",
         "props":[
            {
               "name":"keywords",
               "value":"contol, assessment"
            }
         ],
         "links":[
            {
               "href":"https:\/\/controls-assessment-specification.readthedocs.io\/en\/stable\/index.html",
               "rel":"alternate",
               "media-type":"text\/html"
            }
         ]
      },
      "controls":[
         {
            "id":"cisc-3",
            "title":"Data Protection",
            "props":[
               {
                  "name":"label",
                  "value":"CIS Control 3"
               },
               {
                  "name":"sort-id",
                  "value":"cisc-03"
               }
            ],
            "parts":[
               {
                  "id":"cisc-3_stmt",
                  "name":"statement",
                  "prose":"Develop processes and technical controls to identify, classify, securely handle, retain, and dispose of data."
               },
               {
                  "id":"cisc-3_gdn",
                  "name":"guidance",
                  "prose":"Data is no longer only contained within an enterprise’s border, it is in the cloud, on portable end-user devices where users work from home, and is often shared with partners or online services who might have it anywhere in the world. In addition to sensitive data an enterprise holds related to finances, intellectual property, and customer data, there also might be numerous international regulations for protection of personal data. Data privacy has become increasingly important, and enterprises are learning that privacy is about the appropriate use and management of data, not just encryption. Data must be appropriately managed through its entire lifecycle. These privacy rules can be complicated for multi-national enterprises, of any size, however there are fundamentals that can apply to all.\n\nOnce attackers have penetrated an enterprise’s infrastructure, one of their first tasks is to find and exfiltrate data. Enterprises might not be aware that sensitive data is leaving their environment because they are not monitoring data outflows.\n\nWhile many attacks occur on the network, others involve physical theft of portable end-user devices, attacks on service providers or other partners holding sensitive data. Other sensitive enterprise assets may also include non-computing devices that provide management and control of physical systems, such as Supervisory Control and Data Acquisition (SCADA) systems.\n\nThe enterprise’s loss of control over protected or sensitive data is a serious and often reportable business impact. While some data is compromised or lost as a result of theft or espionage, the vast majority are a result of poorly understood data management rules, and user error. The adoption of data encryption, both in transit and at rest, can provide mitigation against data compromise, and more importantly, is a regulatory requirement for most controlled data."
               }
            ],
            "controls":[
               {
                  "id":"cisc-3.1",
                  "title":"Establish and Maintain a Data Management Process",
                  "props":[
                     {
                        "name":"label",
                        "value":"CIS Safeguard 3.1"
                     },
                     {
                        "name":"sort-id",
                        "value":"cisc-03.01"
                     },
                     {
                        "name":"asset-type",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"data"
                     },
                     {
                        "name":"security-function",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"identify"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"1"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"2"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"3"
                     }
                  ],
                  "parts":[
                     {
                        "id":"cisc-3.1_stmt",
                        "name":"statement",
                        "prose":"Establish and maintain a data management process. In the process, address data sensitivity, data owner, handling of data, data retention limits, and disposal requirements, based on sensitivity and retention standards for the enterprise. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard."
                     }
                  ]
               },
               {
                  "id":"cisc-3.2",
                  "title":"Establish and Maintain a Data Inventory",
                  "props":[
                     {
                        "name":"label",
                        "value":"CIS Safeguard 3.2"
                     },
                     {
                        "name":"sort-id",
                        "value":"cisc-03.02"
                     },
                     {
                        "name":"asset-type",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"data"
                     },
                     {
                        "name":"security-function",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"identify"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"1"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"2"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"3"
                     }
                  ],
                  "links":[
                     {
                        "href":"cisc-1.1",
                        "rel":"dependency"
                     }
                  ],
                  "parts":[
                     {
                        "id":"cisc-3.2_stmt",
                        "name":"statement",
                        "prose":"Establish and maintain a data inventory, based on the enterprise’s data management process. Inventory sensitive data, at a minimum. Review and update inventory annually, at a minimum, with a priority on sensitive data."
                     }
                  ]
               },
               {
                  "id":"cisc-3.3",
                  "title":"Configure Data Access Control Lists",
                  "props":[
                     {
                        "name":"label",
                        "value":"CIS Safeguard 3.3"
                     },
                     {
                        "name":"sort-id",
                        "value":"cisc-03.03"
                     },
                     {
                        "name":"asset-type",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"data"
                     },
                     {
                        "name":"security-function",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"protect"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"1"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"2"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"3"
                     }
                  ],
                  "links":[
                     {
                        "href":"cisc-3.2",
                        "rel":"dependency"
                     },
                     {
                        "href":"cisc-4.1",
                        "rel":"dependency"
                     },
                     {
                        "href":"cisc-5.1",
                        "rel":"dependency"
                     }
                  ],
                  "parts":[
                     {
                        "id":"cisc-3.3_stmt",
                        "name":"statement",
                        "prose":"Configure data access control lists based on a user’s need to know. Apply data access control lists, also known as access permissions, to local and remote file systems, databases, and applications."
                     }
                  ]
               },
               {
                  "id":"cisc-3.4",
                  "title":"Enforce Data Retention",
                  "props":[
                     {
                        "name":"label",
                        "value":"CIS Safeguard 3.4"
                     },
                     {
                        "name":"sort-id",
                        "value":"cisc-03.04"
                     },
                     {
                        "name":"asset-type",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"data"
                     },
                     {
                        "name":"security-function",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"protect"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"1"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"2"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"3"
                     }
                  ],
                  "links":[
                     {
                        "href":"cisc-3.1",
                        "rel":"dependency"
                     },
                     {
                        "href":"cisc-3.2",
                        "rel":"dependency"
                     }
                  ],
                  "parts":[
                     {
                        "id":"cisc-3.4_stmt",
                        "name":"statement",
                        "prose":"Retain data according to the enterprise’s data management process. Data retention must include both minimum and maximum timelines."
                     }
                  ]
               }
            ]
         },
         {
            "id":"cisc-4",
            "title":"Secure Configuration of Enterprise Assets and Software",
            "props":[
               {
                  "name":"label",
                  "value":"CIS Control 4"
               },
               {
                  "name":"sort-id",
                  "value":"cisc-04"
               }
            ],
            "parts":[
               {
                  "id":"cisc-4_stmt",
                  "name":"statement",
                  "prose":"Establish and maintain the secure configuration of enterprise assets (end-user devices, including portable and mobile; network devices; non-computing\/IoT devices; and servers) and software (operating systems and applications)."
               },
               {
                  "id":"cisc-4_gdn",
                  "name":"guidance",
                  "prose":"As delivered from manufacturers and resellers, the default configurations for enterprise assets and software are normally geared towards ease-of-deployment and ease-of-use rather than security. Basic controls, open services and ports, default accounts or passwords, pre-configured Domain Name System (DNS) settings, older (vulnerable) protocols, and pre-installation of unnecessary software can all be exploitable if left in their default state. Further, these security configuration updates need to be managed and maintained over the life cycle of enterprise assets and software. Configuration updates need to be tracked and approved through configuration management workflow process to maintain a record that can be reviewed for compliance, leveraged for incident response, and to support audits. This CIS Control is important to on-premises devices, as well as remote devices, network devices, and cloud environments.\n\nService providers play a key role in modern infrastructures, especially for smaller enterprises. They often are not set up by default in the most secure configuration to provide flexibility for their customers to apply their own security policies. Therefore, the presence of default accounts or passwords, excessive access, or unnecessary services are common in default configurations. These could introduce weaknesses that are under the responsibility of the enterprise that is using the software, rather than the service provider. This extends to ongoing management and updates, as some Platform as a Service (PaaS) only extend to the operating system, so patching and updating hosted applications are under the responsibility of the enterprise.\n\nEven after a strong initial configuration is developed and applied, it must be continually managed to avoid degrading security as software is updated or patched, new security vulnerabilities are reported, and configurations are “tweaked,” to allow the installation of new software or to support new operational requirements."
               }
            ],
            "controls":[
               {
                  "id":"cisc-4.1",
                  "title":"Establish and Maintain a Secure Configuration Process",
                  "props":[
                     {
                        "name":"label",
                        "value":"CIS Safeguard 4.1"
                     },
                     {
                        "name":"sort-id",
                        "value":"cisc-04.01"
                     },
                     {
                        "name":"asset-type",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"applications"
                     },
                     {
                        "name":"security-function",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"protect"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"1"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"2"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"3"
                     }
                  ],
                  "links":[
                     {
                        "href":"cisc-2.1",
                        "rel":"dependency"
                     }
                  ],
                  "parts":[
                     {
                        "id":"cisc-4.1_stmt",
                        "name":"statement",
                        "prose":"Establish and maintain a secure configuration process for enterprise assets (end-user devices, including portable and mobile, non-computing\/IoT devices, and servers) and software (operating systems and applications). Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard."
                     }
                  ]
               },
               {
                  "id":"cisc-4.2",
                  "title":"Establish and Maintain a Secure Configuration Process for Network Infrastructure",
                  "props":[
                     {
                        "name":"label",
                        "value":"CIS Safeguard 4.2"
                     },
                     {
                        "name":"sort-id",
                        "value":"cisc-04.02"
                     },
                     {
                        "name":"asset-type",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"network"
                     },
                     {
                        "name":"security-function",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"protect"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"1"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"2"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"3"
                     }
                  ],
                  "links":[
                     {
                        "href":"cisc-2.1",
                        "rel":"dependency"
                     }
                  ],
                  "parts":[
                     {
                        "id":"cisc-4.2_stmt",
                        "name":"statement",
                        "prose":"Establish and maintain a secure configuration process for network devices. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard."
                     }
                  ]
               },
               {
                  "id":"cisc-4.3",
                  "title":"Configure Automatic Session Locking on Enterprise Assets",
                  "props":[
                     {
                        "name":"label",
                        "value":"CIS Safeguard 4.3"
                     },
                     {
                        "name":"sort-id",
                        "value":"cisc-04.03"
                     },
                     {
                        "name":"asset-type",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"users"
                     },
                     {
                        "name":"security-function",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"protect"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"1"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"2"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"3"
                     }
                  ],
                  "links":[
                     {
                        "href":"cisc-1.1",
                        "rel":"dependency"
                     },
                     {
                        "href":"cisc-2.1",
                        "rel":"dependency"
                     },
                     {
                        "href":"cisc-2.1",
                        "rel":"dependency"
                     }
                  ],
                  "parts":[
                     {
                        "id":"cisc-4.3_stmt",
                        "name":"statement",
                        "prose":"Configure automatic session locking on enterprise assets after a defined period of inactivity. For general purpose operating systems, the period must not exceed 15 minutes. For mobile end-user devices, the period must not exceed 2 minutes."
                     }
                  ]
               },
               {
                  "id":"cisc-4.4",
                  "title":"Implement and Manage a Firewall on Servers",
                  "props":[
                     {
                        "name":"label",
                        "value":"CIS Safeguard 4.4"
                     },
                     {
                        "name":"sort-id",
                        "value":"cisc-04.04"
                     },
                     {
                        "name":"asset-type",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"devices"
                     },
                     {
                        "name":"security-function",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"protect"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"1"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"2"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"3"
                     }
                  ],
                  "links":[
                     {
                        "href":"cisc-1.1",
                        "rel":"dependency"
                     },
                     {
                        "href":"cisc-2.1",
                        "rel":"dependency"
                     },
                     {
                        "href":"cisc-4.1",
                        "rel":"dependency"
                     }
                  ],
                  "parts":[
                     {
                        "id":"cisc-4.4_stmt",
                        "name":"statement",
                        "prose":"Implement and manage a firewall on servers, where supported. Example implementations include a virtual firewall, operating system firewall, or a third-party firewall agent."
                     }
                  ]
               },
               {
                  "id":"cisc-4.5",
                  "title":"Implement and Manage a Firewall on End-User Devices",
                  "props":[
                     {
                        "name":"label",
                        "value":"CIS Safeguard 4.5"
                     },
                     {
                        "name":"sort-id",
                        "value":"cisc-04.05"
                     },
                     {
                        "name":"asset-type",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"devices"
                     },
                     {
                        "name":"security-function",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"protect"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"1"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"2"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"3"
                     }
                  ],
                  "links":[
                     {
                        "href":"cisc-1.1",
                        "rel":"dependency"
                     },
                     {
                        "href":"cisc-2.1",
                        "rel":"dependency"
                     },
                     {
                        "href":"cisc-4.1",
                        "rel":"dependency"
                     }
                  ],
                  "parts":[
                     {
                        "id":"cisc-4.5_stmt",
                        "name":"statement",
                        "prose":"Implement and manage a host-based firewall or port-filtering tool on end-user devices, with a default-deny rule that drops all traffic except those services and ports that are explicitly allowed."
                     }
                  ]
               },
               {
                  "id":"cisc-4.6",
                  "title":"Securely Manage Enterprise Assets and Software",
                  "props":[
                     {
                        "name":"label",
                        "value":"CIS Safeguard 4.6"
                     },
                     {
                        "name":"sort-id",
                        "value":"cisc-04.06"
                     },
                     {
                        "name":"asset-type",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"network"
                     },
                     {
                        "name":"security-function",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"protect"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"1"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"2"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"3"
                     }
                  ],
                  "links":[
                     {
                        "href":"cisc-1.1",
                        "rel":"dependency"
                     },
                     {
                        "href":"cisc-2.1",
                        "rel":"dependency"
                     },
                     {
                        "href":"cisc-4.1",
                        "rel":"dependency"
                     }
                  ],
                  "parts":[
                     {
                        "id":"cisc-4.6_stmt",
                        "name":"statement",
                        "prose":"Securely manage enterprise assets and software. Example implementations include managing configuration through version-controlled-infrastructure-as-code and accessing administrative interfaces over secure network protocols, such as Secure Shell (SSH) and Hypertext Transfer Protocol Secure (HTTPS). Do not use insecure management protocols, such as Telnet (Teletype Network) and HTTP, unless operationally essential."
                     }
                  ]
               },
               {
                  "id":"cisc-4.7",
                  "title":"Manage Default Accounts on Enterprise Assets and Software",
                  "props":[
                     {
                        "name":"label",
                        "value":"CIS Safeguard 4.7"
                     },
                     {
                        "name":"sort-id",
                        "value":"cisc-04.07"
                     },
                     {
                        "name":"asset-type",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"users"
                     },
                     {
                        "name":"security-function",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"potect"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"1"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"2"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"3"
                     }
                  ],
                  "links":[
                     {
                        "href":"cisc-1.1",
                        "rel":"dependency"
                     },
                     {
                        "href":"cisc-2.1",
                        "rel":"dependency"
                     },
                     {
                        "href":"cisc-5.2",
                        "rel":"dependency"
                     }
                  ],
                  "parts":[
                     {
                        "id":"cisc-4.7_stmt",
                        "name":"statement",
                        "prose":"Manage default accounts on enterprise assets and software, such as root, administrator, and other pre-configured vendor accounts. Example implementations can include: disabling default accounts or making them unusable."
                     }
                  ]
               },
               {
                  "id":"cisc-4.8",
                  "title":"Uninstall or Disable Unnecessary Services on Enterprise Assets and Software",
                  "props":[
                     {
                        "name":"label",
                        "value":"CIS Safeguard 4.8"
                     },
                     {
                        "name":"sort-id",
                        "value":"cisc-04.08"
                     },
                     {
                        "name":"asset-type",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"devices"
                     },
                     {
                        "name":"security-function",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"protect"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"2"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"3"
                     }
                  ],
                  "links":[
                     {
                        "href":"cisc-1.1",
                        "rel":"dependency"
                     },
                     {
                        "href":"cisc-2.1",
                        "rel":"dependency"
                     }
                  ],
                  "parts":[
                     {
                        "id":"cisc-4.8_stmt",
                        "name":"statement",
                        "prose":"Uninstall or disable unnecessary services on enterprise assets and software, such as an unused file sharing service, web application module, or service function."
                     }
                  ]
               }
            ]
         },
         {
            "id":"cisc-5",
            "title":"Account Management",
            "props":[
               {
                  "name":"label",
                  "value":"CIS Control 5"
               },
               {
                  "name":"sort-id",
                  "value":"cisc-05"
               }
            ],
            "parts":[
               {
                  "id":"cisc-5_stmt",
                  "name":"statement",
                  "prose":"Use processes and tools to assign and manage authorization to credentials for user accounts, including administrator accounts, as well as service accounts, to enterprise assets and software."
               },
               {
                  "id":"cisc-5_gdn",
                  "name":"guidance",
                  "prose":"It is easier for an external or internal threat actor to gain unauthorized access to enterprise assets or data through using valid user credentials than through “hacking” the environment. There are many ways to covertly obtain access to user accounts, including: weak passwords, accounts still valid after a user leaves the enterprise, dormant or lingering test accounts, shared accounts that have not been changed in months or years, service accounts embedded in applications for scripts, a user having the same password as one they use for an online account that has been compromised (in a public password dump), social engineering a user to give their password, or using malware to capture passwords or tokens in memory or over the network.\n\nAdministrative, or highly privileged, accounts are a particular target, because they allow attackers to add other accounts, or make changes to assets that could make them more vulnerable to other attacks. Service accounts are also sensitive, as they are often shared among teams, internal and external to the enterprise, and sometimes not known about, only to be revealed in standard account management audits.\n\nFinally, account logging and monitoring is a critical component of security operations. While account logging and monitoring are covered in CIS Control 8 (Audit Log Management), it is important in the development of a comprehensive Identity and Access Management (IAM) program."
               }
            ],
            "controls":[
               {
                  "id":"cisc-5.1",
                  "title":"Establish and Maintain an Inventory of Accounts",
                  "props":[
                     {
                        "name":"label",
                        "value":"CIS Safeguard 5.1"
                     },
                     {
                        "name":"sort-id",
                        "value":"cisc-05.01"
                     },
                     {
                        "name":"asset-type",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"users"
                     },
                     {
                        "name":"security-function",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"identify"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"1"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"2"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"3"
                     }
                  ],
                  "links":[
                     {
                        "href":"cisc-2.1",
                        "rel":"dependency"
                     }
                  ],
                  "parts":[
                     {
                        "id":"cisc-5.1_stmt",
                        "name":"statement",
                        "prose":"Establish and maintain an inventory of all accounts managed in the enterprise. The inventory must include both user and administrator accounts. The inventory, at a minimum, should contain the person’s name, username, start\/stop dates, and department. Validate that all active accounts are authorized, on a recurring schedule at a minimum quarterly, or more frequently."
                     }
                  ]
               },
               {
                  "id":"cisc-5.2",
                  "title":"Use Unique Passwords",
                  "props":[
                     {
                        "name":"label",
                        "value":"CIS Safeguard 5.2"
                     },
                     {
                        "name":"sort-id",
                        "value":"cisc-05.02"
                     },
                     {
                        "name":"asset-type",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"users"
                     },
                     {
                        "name":"security-function",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"protect"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"1"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"2"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"3"
                     }
                  ],
                  "parts":[
                     {
                        "id":"cisc-5.2_stmt",
                        "name":"statement",
                        "prose":"Use unique passwords for all enterprise assets. Best practice implementation includes, at a minimum, an 8-character password for accounts using MFA and a 14-character password for accounts not using MFA."
                     }
                  ]
               }
            ]
         },
         {
            "id":"cisc-6",
            "title":"Access Control Management",
            "props":[
               {
                  "name":"label",
                  "value":"CIS Control 6"
               },
               {
                  "name":"sort-id",
                  "value":"cisc-06"
               }
            ],
            "parts":[
               {
                  "id":"cisc-6_stmt",
                  "name":"statement",
                  "prose":"Use processes and tools to create, assign, manage, and revoke access credentials and privileges for user, administrator, and service accounts for enterprise assets and software."
               },
               {
                  "id":"cisc-6_gdn",
                  "name":"guidance",
                  "prose":"Where CIS Control 5 deals specifically with account management, CIS Control 6 focuses on managing what access these accounts have, ensuring users only have access to the data or enterprise assets appropriate for their role, and ensuring that there is strong authentication for critical or sensitive enterprise data or functions. Accounts should only have the minimal authorization needed for the role. Developing consistent access rights for each role and assigning roles to users is a best practice. Developing a program for complete provision and de-provisioning access is also important. Centralizing this function is ideal.\n\nThere are some user activities that pose greater risk to an enterprise, either because they are accessed from untrusted networks, or performing administrator functions that allow the ability to add, change, or remove other accounts, or make configuration changes to operating systems or applications to make them less secure. This also enforces the importance of using MFA and Privileged Access Management (PAM) tools.\n\nSome users have access to enterprise assets or data they do not need for their role; this might be due to an immature process that gives all users all access, or lingering access as users change roles within the enterprise over time. Local administrator privileges to users’ laptops is also an issue, as any malicious code installed or downloaded by the user can have greater impact on the enterprise asset running as administrator. User, administrator, and service account access should be based on enterprise role and need."
               }
            ],
            "controls":[
               {
                  "id":"cisc-6.1",
                  "title":"Establish an Access Granting Process",
                  "props":[
                     {
                        "name":"label",
                        "value":"CIS Safeguard 6.1"
                     },
                     {
                        "name":"sort-id",
                        "value":"cisc-06.01"
                     },
                     {
                        "name":"asset-type",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"users"
                     },
                     {
                        "name":"security-function",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"protect"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"1"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"2"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"3"
                     }
                  ],
                  "parts":[
                     {
                        "id":"cisc-6.1_stmt",
                        "name":"statement",
                        "prose":"Establish and follow a process, preferably automated, for granting access to enterprise assets upon new hire, rights grant, or role change of a user."
                     }
                  ]
               },
               {
                  "id":"cisc-6.2",
                  "title":"Establish an Access Revoking Process",
                  "props":[
                     {
                        "name":"label",
                        "value":"CIS Safeguard 6.2"
                     },
                     {
                        "name":"sort-id",
                        "value":"cisc-06.02"
                     },
                     {
                        "name":"asset-type",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"users"
                     },
                     {
                        "name":"security-function",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"protect"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"1"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"2"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"3"
                     }
                  ],
                  "parts":[
                     {
                        "id":"cisc-6.2_stmt",
                        "name":"statement",
                        "prose":"Establish and follow a process, preferably automated, for revoking access to enterprise assets, through disabling accounts immediately upon termination, rights revocation, or role change of a user. Disabling accounts, instead of deleting accounts, may be necessary to preserve audit trails."
                     }
                  ]
               }
            ]
         },
         {
            "id":"cisc-8",
            "title":"Audit Log Management",
            "props":[
               {
                  "name":"label",
                  "value":"CIS Control 8"
               },
               {
                  "name":"sort-id",
                  "value":"cisc-08"
               }
            ],
            "parts":[
               {
                  "id":"cisc-8_stmt",
                  "name":"statement",
                  "prose":"Collect, alert, review, and retain audit logs of events that could help detect, understand, or recover from an attack."
               },
               {
                  "id":"cisc-8_gdn",
                  "name":"guidance",
                  "prose":"Log collection and analysis is critical for an enterprise’s ability to detect malicious activity quickly. Sometimes audit records are the only evidence of a successful attack. Attackers know that many enterprises keep audit logs for compliance purposes, but rarely analyze them. Attackers use this knowledge to hide their location, malicious software, and activities on victim machines. Due to poor or nonexistent log analysis processes, attackers sometimes control victim machines for months or years without anyone in the target enterprise knowing.\n\nThere are two types of logs that are generally treated and often configured independently: system logs and audit logs. System logs typically provide system-level events that show various system process start\/end times, crashes, etc. These are native to systems, and take less configuration to turn on. Audit logs typically include user-level events – when a user logged in, accessed a file, etc. – and take more planning and effort to set up.\n\nLogging records are also critical for incident response. After an attack has been detected, log analysis can help enterprises understand the extent of an attack. Complete logging records can show, for example, when and how the attack occurred, what information was accessed, and if data was exfiltrated. Retention of logs is also critical in case a follow-up investigation is required or if an attack remained undetected for a long period of time."
               }
            ],
            "controls":[
               {
                  "id":"cisc-8.1",
                  "title":"Establish and Maintain an Audit Log Management Process",
                  "props":[
                     {
                        "name":"label",
                        "value":"CIS Safeguard 8.1"
                     },
                     {
                        "name":"sort-id",
                        "value":"cisc-08.01"
                     },
                     {
                        "name":"asset-type",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"network"
                     },
                     {
                        "name":"security-function",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"protect"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"1"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"2"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"3"
                     }
                  ],
                  "parts":[
                     {
                        "id":"cisc-8.1_stmt",
                        "name":"statement",
                        "prose":"Establish and maintain an audit log management process that defines the enterprise’s logging requirements. At a minimum, address the collection, review, and retention of audit logs for enterprise assets. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard."
                     }
                  ]
               },
               {
                  "id":"cisc-8.2",
                  "title":"Collect Audit Logs",
                  "props":[
                     {
                        "name":"label",
                        "value":"CIS Safeguard 8.2"
                     },
                     {
                        "name":"sort-id",
                        "value":"cisc-08.02"
                     },
                     {
                        "name":"asset-type",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"network"
                     },
                     {
                        "name":"security-function",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"detect"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"1"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"2"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"3"
                     }
                  ],
                  "links":[
                     {
                        "href":"cisc-1.1",
                        "rel":"dependency"
                     },
                     {
                        "href":"cisc-4.1",
                        "rel":"dependency"
                     },
                     {
                        "href":"cisc-8.1",
                        "rel":"dependency"
                     }
                  ],
                  "parts":[
                     {
                        "id":"cisc-8.2_stmt",
                        "name":"statement",
                        "prose":"Collect audit logs. Ensure that logging, per the enterprise’s audit log management process, has been enabled across enterprise assets."
                     }
                  ]
               },
               {
                  "id":"cisc-8.3",
                  "title":"Ensure Adequate Audit Log Storage",
                  "props":[
                     {
                        "name":"label",
                        "value":"CIS Safeguard 8.3"
                     },
                     {
                        "name":"sort-id",
                        "value":"cisc-08.03"
                     },
                     {
                        "name":"asset-type",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"network"
                     },
                     {
                        "name":"security-function",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"protect"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"1"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"2"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"3"
                     }
                  ],
                  "links":[
                     {
                        "href":"cisc-1.1",
                        "rel":"dependency"
                     }
                  ],
                  "parts":[
                     {
                        "id":"cisc-8.3_stmt",
                        "name":"statement",
                        "prose":"Ensure that logging destinations maintain adequate storage to comply with the enterprise’s audit log management process."
                     }
                  ]
               },
               {
                  "id":"cisc-8.4",
                  "title":"Standardize Time Synchronization",
                  "props":[
                     {
                        "name":"label",
                        "value":"CIS Safeguard 8.4"
                     },
                     {
                        "name":"sort-id",
                        "value":"cisc-08.04"
                     },
                     {
                        "name":"asset-type",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"network"
                     },
                     {
                        "name":"security-function",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"protect"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"2"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"3"
                     }
                  ],
                  "links":[
                     {
                        "href":"cisc-1.1",
                        "rel":"dependency"
                     }
                  ],
                  "parts":[
                     {
                        "id":"cisc-8.4_stmt",
                        "name":"statement",
                        "prose":"Standardize time synchronization. Configure at least two synchronized time sources across enterprise assets, where supported."
                     }
                  ]
               },
               {
                  "id":"cisc-8.5",
                  "title":"Collect Detailed Audit Logs",
                  "props":[
                     {
                        "name":"label",
                        "value":"CIS Safeguard 8.5"
                     },
                     {
                        "name":"sort-id",
                        "value":"cisc-08.05"
                     },
                     {
                        "name":"asset-type",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"network"
                     },
                     {
                        "name":"security-function",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"detect"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"2"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"3"
                     }
                  ],
                  "links":[
                     {
                        "href":"cisc-1.1",
                        "rel":"dependency"
                     }
                  ],
                  "parts":[
                     {
                        "id":"cisc-8.5_stmt",
                        "name":"statement",
                        "prose":"Configure detailed audit logging for enterprise assets containing sensitive data. Include event source, date, username, timestamp, source addresses, destination addresses, and other useful elements that could assist in a forensic investigation."
                     }
                  ]
               },
               {
                  "id":"cisc-8.6",
                  "title":"Collect DNS Query Audit Logs",
                  "props":[
                     {
                        "name":"label",
                        "value":"CIS Safeguard 8.6"
                     },
                     {
                        "name":"sort-id",
                        "value":"cisc-08.06"
                     },
                     {
                        "name":"asset-type",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"network"
                     },
                     {
                        "name":"security-function",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"detect"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"2"
                     },
                     {
                        "name":"implementation-group",
                        "ns":"https:\/\/cisecurity.org\/ns\/oscal",
                        "value":"3"
                     }
                  ],
                  "links":[
                     {
                        "href":"cisc-1.1",
                        "rel":"dependency"
                     },
                     {
                        "href":"cisc-4.1",
                        "rel":"dependency"
                     }
                  ],
                  "parts":[
                     {
                        "id":"cisc-8.6_stmt",
                        "name":"statement",
                        "prose":"Collect DNS query audit logs on enterprise assets, where appropriate and supported."
                     }
                  ]
               }
            ]
         }
      ]
   }
}